## Pyspark Handling Missing Values
- Dropping Columns
- Dropping Rows
- Various Parameter in Dropping functionalities
- Handling Missing values by Mean, Median, Mode

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Practise').getOrCreate()

In [5]:
spark

In [6]:
#read csv
df = spark.read.csv('test2.csv',header=True,inferSchema=True)

In [7]:
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  26|         3| 30000|
|  Sunny|  30|         4| 35000|
|  Rohit|  25|         8| 50000|
|   Paul|  24|         2| 20000|
| Harsha|  21|         1| 15000|
|Shubham|  23|         2| 18000|
| Mahesh|NULL|      NULL| 40000|
|   NULL|  34|        10| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [8]:
## drop the column
df.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  26|         3| 30000|
|  30|         4| 35000|
|  25|         8| 50000|
|  24|         2| 20000|
|  21|         1| 15000|
|  23|         2| 18000|
|NULL|      NULL| 40000|
|  34|        10| 38000|
|  36|      NULL|  NULL|
+----+----------+------+

In [10]:
#drop Null values
df.na.drop().show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 26|         3| 30000|
|  Sunny| 30|         4| 35000|
|  Rohit| 25|         8| 50000|
|   Paul| 24|         2| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [11]:
## any==how
df.na.drop(how="all").show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  26|         3| 30000|
|  Sunny|  30|         4| 35000|
|  Rohit|  25|         8| 50000|
|   Paul|  24|         2| 20000|
| Harsha|  21|         1| 15000|
|Shubham|  23|         2| 18000|
| Mahesh|NULL|      NULL| 40000|
|   NULL|  34|        10| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [12]:
df.na.drop(how="any").show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 26|         3| 30000|
|  Sunny| 30|         4| 35000|
|  Rohit| 25|         8| 50000|
|   Paul| 24|         2| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [13]:
##threshold(atleast 2 nonnull)
df.na.drop(how="any",thresh=2).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  26|         3| 30000|
|  Sunny|  30|         4| 35000|
|  Rohit|  25|         8| 50000|
|   Paul|  24|         2| 20000|
| Harsha|  21|         1| 15000|
|Shubham|  23|         2| 18000|
| Mahesh|NULL|      NULL| 40000|
|   NULL|  34|        10| 38000|
+-------+----+----------+------+

In [14]:
#subset
df.na.drop(how="any",subset=["Experience"]).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 26|         3| 30000|
|  Sunny| 30|         4| 35000|
|  Rohit| 25|         8| 50000|
|   Paul| 24|         2| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
|   NULL| 34|        10| 38000|
+-------+---+----------+------+

In [17]:
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  26|         3| 30000|
|  Sunny|  30|         4| 35000|
|  Rohit|  25|         8| 50000|
|   Paul|  24|         2| 20000|
| Harsha|  21|         1| 15000|
|Shubham|  23|         2| 18000|
| Mahesh|NULL|      NULL| 40000|
|   NULL|  34|        10| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [19]:
#filling Null vlues
df.na.fill("Missing Values").show()

+--------------+----+----------+------+
|          Name| Age|Experience|Salary|
+--------------+----+----------+------+
|       Vaibhav|  26|         3| 30000|
|         Sunny|  30|         4| 35000|
|         Rohit|  25|         8| 50000|
|          Paul|  24|         2| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 38000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [20]:
df.na.fill(value=0).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 26|         3| 30000|
|  Sunny| 30|         4| 35000|
|  Rohit| 25|         8| 50000|
|   Paul| 24|         2| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
| Mahesh|  0|         0| 40000|
|   NULL| 34|        10| 38000|
|   NULL| 36|         0|     0|
+-------+---+----------+------+

In [21]:
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  26|         3| 30000|
|  Sunny|  30|         4| 35000|
|  Rohit|  25|         8| 50000|
|   Paul|  24|         2| 20000|
| Harsha|  21|         1| 15000|
|Shubham|  23|         2| 18000|
| Mahesh|NULL|      NULL| 40000|
|   NULL|  34|        10| 38000|
|   NULL|  36|      NULL|  NULL|
+-------+----+----------+------+

In [25]:
#imputer (to fill NULL values)
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=["Age","Experience","Salary"],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]
).setStrategy("mean")

In [26]:
imputer.fit(df).transform(df).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|Vaibhav|  26|         3| 30000|         26|                 3|         30000|
|  Sunny|  30|         4| 35000|         30|                 4|         35000|
|  Rohit|  25|         8| 50000|         25|                 8|         50000|
|   Paul|  24|         2| 20000|         24|                 2|         20000|
| Harsha|  21|         1| 15000|         21|                 1|         15000|
|Shubham|  23|         2| 18000|         23|                 2|         18000|
| Mahesh|NULL|      NULL| 40000|         27|                 4|         40000|
|   NULL|  34|        10| 38000|         34|                10|         38000|
|   NULL|  36|      NULL|  NULL|         36|                 4|         30750|
+-------+----+----------+------+-----------+------------------+--------------+